```
         2025/09/05 15:32:44 Terraform plan |   # module.kube_audit[0].helm_release.kube_audit will be updated in-place
         2025/09/05 15:32:44 Terraform plan |   ~ resource "helm_release" "kube_audit" {
         2025/09/05 15:32:44 Terraform plan |       ~ id                         = "ibmcloud-kube-audit" -> (known after apply)
         2025/09/05 15:32:44 Terraform plan |       ~ metadata                   = {
         2025/09/05 15:32:44 Terraform plan |           ~ app_version    = "1.0.0" -> (known after apply)
         2025/09/05 15:32:44 Terraform plan |           ~ chart          = "kube-audit" -> (known after apply)
         2025/09/05 15:32:44 Terraform plan |           ~ first_deployed = 1757085915 -> (known after apply)
         2025/09/05 15:32:44 Terraform plan |           ~ last_deployed  = 1757085915 -> (known after apply)
         2025/09/05 15:32:44 Terraform plan |           ~ name           = "ibmcloud-kube-audit" -> (known after apply)
         2025/09/05 15:32:44 Terraform plan |           ~ namespace      = "default" -> (known after apply)
         2025/09/05 15:32:44 Terraform plan |           + notes          = (known after apply)
         2025/09/05 15:32:44 Terraform plan |           ~ revision       = 1 -> (known after apply)
         2025/09/05 15:32:44 Terraform plan |           ~ values         = jsonencode({}) -> (known after apply)
         2025/09/05 15:32:44 Terraform plan |           ~ version        = "0.0.1" -> (known after apply)
         2025/09/05 15:32:44 Terraform plan |         } -> (known after apply)
         2025/09/05 15:32:44 Terraform plan |         name                       = "ibmcloud-kube-audit"
         2025/09/05 15:32:44 Terraform plan |       - postrender                 = {
         2025/09/05 15:32:44 Terraform plan |           - args        = [] -> null
         2025/09/05 15:32:44 Terraform plan |           - binary_path = "" -> null
         2025/09/05 15:32:44 Terraform plan |         } -> null
         2025/09/05 15:32:44 Terraform plan |       ~ set                        = [
         2025/09/05 15:32:44 Terraform plan |           ~ {
         2025/09/05 15:32:44 Terraform plan |               ~ name  = "image.name" -> "metadata.name"
         2025/09/05 15:32:44 Terraform plan |               ~ value = "icr.io/ibm/ibmcloud-kube-audit-to-ibm-cloud-logs" -> "ibmcloud-kube-audit"
         2025/09/05 15:32:44 Terraform plan |                 # (1 unchanged attribute hidden)
         2025/09/05 15:32:44 Terraform plan |             },
         2025/09/05 15:32:44 Terraform plan |           ~ {
         2025/09/05 15:32:44 Terraform plan |               ~ name  = "image.tag" -> "metadata.namespace"
         2025/09/05 15:32:44 Terraform plan |               ~ value = *image tag* -> "ibm-kube-audit"
         2025/09/05 15:32:44 Terraform plan |                 # (1 unchanged attribute hidden)
         2025/09/05 15:32:44 Terraform plan |             },
         2025/09/05 15:32:44 Terraform plan |           ~ {
         2025/09/05 15:32:44 Terraform plan |               ~ name  = "metadata.name" -> "image.name"
         2025/09/05 15:32:44 Terraform plan |               ~ value = "ibmcloud-kube-audit" -> "icr.io/ibm/ibmcloud-kube-audit-to-ibm-cloud-logs"
         2025/09/05 15:32:44 Terraform plan |                 # (1 unchanged attribute hidden)
         2025/09/05 15:32:44 Terraform plan |             },
         2025/09/05 15:32:44 Terraform plan |           ~ {
         2025/09/05 15:32:44 Terraform plan |               ~ name  = "metadata.namespace" -> "image.tag"
         2025/09/05 15:32:44 Terraform plan |               ~ value = "ibm-kube-audit" -> *image tag*
         2025/09/05 15:32:44 Terraform plan |                 # (1 unchanged attribute hidden)
         2025/09/05 15:32:44 Terraform plan |             },
         2025/09/05 15:32:44 Terraform plan |         ]
         2025/09/05 15:32:44 Terraform plan |       - set_list                   = [] -> null
         2025/09/05 15:32:44 Terraform plan |       - set_sensitive              = [] -> null
         2025/09/05 15:32:44 Terraform plan |       - set_wo_revision            = 1 -> null
         2025/09/05 15:32:44 Terraform plan |         # (26 unchanged attributes hidden)
         2025/09/05 15:32:44 Terraform plan |     }